Repository: MikoMikocchi/Macbooru
Catalog: Macbooru/Localization/Localizable.xcstrings
Source language: en
Languages: ja, ru

# commands.focusSearch
source: Focus search
ja: 検索にフォーカス
ru: Фокус на поиск

# commands.navigation
source: Navigation
ja: ナビゲーション
ru: Навигация

# commands.nextPage
source: Next page
ja: 次のページ
ru: Следующая страница

# commands.nextPost
source: Next post
ja: 次の投稿
ru: Следующий пост

# commands.pageSize15
source: Page size: 15
ja: ページサイズ: 15
ru: Размер страницы: 15

# commands.pageSize30
source: Page size: 30
ja: ページサイズ: 30
ru: Размер страницы: 30

# commands.pageSize60
source: Page size: 60
ja: ページサイズ: 60
ru: Размер страницы: 60

# commands.prevPage
source: Previous page
ja: 前のページ
ru: Предыдущая страница

# commands.prevPost
source: Previous post
ja: 前の投稿
ru: Предыдущий пост

# commands.search
source: Search
ja: 検索
ru: Поиск

# error.accessDenied
source: Access denied. Check that the API key and username are correct.
ja: アクセスが拒否されました。APIキーとユーザー名が正しいか確認してください。
ru: Доступ запрещён. Проверьте, верно ли указан API key и имя пользователя.

# error.commentAuthRequired
source: Authenticate with Danbooru (API key + username) to use this action.
ja: この操作にはDanbooruの認証（APIキー + ユーザー名）が必要です。
ru: Авторизуйтесь в Danbooru (API key + username) для этого действия.

# error.credentialsRequired
source: Danbooru credentials required
ja: Danbooruの認証情報が必要です
ru: Укажите учетные данные Danbooru

# error.decoding
source: Failed to process server response. Check the API and try again.
ja: サーバーの応答を処理できませんでした。APIを確認して再試行してください。
ru: Не удалось обработать ответ сервера. Проверьте API и повторите.

# error.invalidCredentials
source: Invalid Danbooru credentials
ja: 無効なDanbooru認証情報
ru: Недействительные учетные данные Danbooru

# error.invalidResponse
source: Invalid server response. Try again later.
ja: サーバーの応答が無効です。後でもう一度お試しください。
ru: Некорректный ответ сервера. Попробуйте ещё раз позже.

# error.missingCredentials
source: Enter Username and API key from Danbooru settings (My Account → API Key).
ja: Danbooru設定のユーザー名とAPIキーを入力してください（My Account → API Key）。
ru: Укажите Username и API key из настроек Danbooru (My Account → API Key).

# error.network
source: Network error: %@
ja: ネットワークエラー: %@
ru: Сетевая ошибка: %@

# error.noInternet
source: No internet connection.
ja: インターネットに接続されていません。
ru: Нет соединения с интернетом.

# error.rateLimit
source: Rate limit exceeded. Wait a moment and try again.
ja: レート制限を超えました。しばらく待ってから再試行してください。
ru: Превышен лимит запросов (rate limit). Подождите немного и попробуйте снова.

# error.serverStatus
source: Server returned an error (status %lld). Try again later.
ja: サーバーがエラーを返しました（status %lld）。後でもう一度お試しください。
ru: Сервер вернул ошибку (status %lld). Попробуйте позднее.

# grid.backToPage
source: Return to page %lld
ja: ページ %lld に戻る
ru: Вернуться к стр. %lld

# grid.errorTitle
source: Error
ja: エラー
ru: Ошибка

# grid.loadFailed
source: Failed to load posts: %@
ja: 投稿の読み込みに失敗しました: %@
ru: Не удалось загрузить посты: %@

# grid.pageControls
source: Page controls
ja: ページ操作
ru: Управление страницами

# grid.postsTitle
source: Posts
ja: 投稿
ru: Посты

# grid.refresh
source: Refresh
ja: 更新
ru: Обновить

# grid.retry
source: Retry
ja: 再試行
ru: Повторить

# grid.unableFindLastPage
source: Unable to find last page
ja: 最終ページが見つかりません
ru: Не удалось найти последнюю страницу

# postDetail.actions
source: Actions
ja: アクション
ru: Действия

# postDetail.actionsHint
source: Favorite or vote
ja: お気に入りまたは投票
ru: Добавить в избранное или проголосовать

# postDetail.addComment
source: Add a comment
ja: コメントを追加
ru: Добавить комментарий

# postDetail.addFavorite
source: Add to favorites
ja: お気に入りに追加
ru: В избранное

# postDetail.anonymous
source: Anonymous
ja: 匿名
ru: Аноним

# postDetail.center
source: Center
ja: 中央
ru: По центру

# postDetail.commentCredentials
source: Add Danbooru credentials in Settings to post comments.
ja: コメントを投稿するには設定でDanbooruの認証情報を追加してください。
ru: Для отправки комментариев добавьте креды Danbooru в настройках.

# postDetail.commentFrom
source: Comment from %@
ja: %@ のコメント
ru: Комментарий от %@

# postDetail.commentHint
source: Enter a comment
ja: コメントを入力
ru: Введите комментарий

# postDetail.commentRules
source: Remember to follow community rules.
ja: コミュニティのルールを守ってください。
ru: Не забудьте соблюдать правила сообщества.

# postDetail.comments
source: Comments
ja: コメント
ru: Комментарии

# postDetail.copy
source: Copy
ja: コピー
ru: Копировать

# postDetail.copyHint
source: Copy useful post links
ja: 便利な投稿リンクをコピー
ru: Скопировать полезные ссылки поста

# postDetail.copyImage
source: Copy image
ja: 画像をコピー
ru: Скопировать изображение

# postDetail.copyOriginalURL
source: Copy original URL
ja: オリジナルURLをコピー
ru: Скопировать URL оригинала

# postDetail.copyPostURL
source: Copy post URL
ja: 投稿URLをコピー
ru: Скопировать URL поста

# postDetail.copySectionTags
source: Copy section tags
ja: セクションのタグをコピー
ru: Скопировать теги раздела

# postDetail.copySourceURL
source: Copy source URL
ja: ソースURLをコピー
ru: Скопировать URL источника

# postDetail.copyTags
source: Copy tags
ja: タグをコピー
ru: Скопировать теги

# postDetail.created
source: Created
ja: 作成日
ru: Создан

# postDetail.credentialsRequired
source: Add Danbooru credentials in Settings
ja: 設定でDanbooruの認証情報を追加してください
ru: Укажите учетные данные Danbooru в настройках

# postDetail.dimensions
source: Dimensions
ja: サイズ
ru: Размер

# postDetail.download
source: Download
ja: ダウンロード
ru: Скачать

# postDetail.downloadBest
source: Download best image
ja: 最適な画像をダウンロード
ru: Скачать лучшее изображение

# postDetail.downvotes
source: Downvotes
ja: 低評価
ru: Минусы

# postDetail.favAndVote
source: Favorites and voting
ja: お気に入りと投票
ru: Избранное и голосование

# postDetail.favCount
source: In favorites
ja: お気に入り数
ru: В избранном

# postDetail.favorite
source: Favorite
ja: お気に入り
ru: Избранное

# postDetail.fit
source: Fit
ja: フィット
ru: Вписать

# postDetail.info
source: Information
ja: 情報
ru: Информация

# postDetail.inProgress
source: In progress
ja: 実行中
ru: Выполняется

# postDetail.loading
source: Loading
ja: 読み込み中
ru: Загрузка

# postDetail.loadingComments
source: Loading comments…
ja: コメントを読み込み中…
ru: Загрузка комментариев…

# postDetail.loadMore
source: Load more
ja: さらに読み込む
ru: Загрузить ещё

# postDetail.more
source: More
ja: その他
ru: Ещё

# postDetail.moreHint
source: Show Macbooru downloads folder
ja: Macbooruのダウンロードフォルダを表示
ru: Показать папку загрузок Macbooru

# postDetail.nextPost
source: Next post
ja: 次の投稿
ru: Следующий пост

# postDetail.no
source: No
ja: いいえ
ru: Нет

# postDetail.noComments
source: No comments yet
ja: コメントはまだありません
ru: Комментариев пока нет

# postDetail.noTags
source: No tags
ja: タグなし
ru: Нет тегов

# postDetail.open
source: Open
ja: 開く
ru: Открыть

# postDetail.openHint
source: Open post links in browser
ja: 投稿のリンクをブラウザで開く
ru: Открыть ссылки поста в браузере

# postDetail.openLarge
source: Open large
ja: largeを開く
ru: Открыть large

# postDetail.openOriginal
source: Open original
ja: オリジナルを開く
ru: Открыть оригинал

# postDetail.openPostPage
source: Open post page
ja: 投稿ページを開く
ru: Открыть страницу поста

# postDetail.openSource
source: Open source
ja: ソースを開く
ru: Открыть источник

# postDetail.prevPost
source: Previous post
ja: 前の投稿
ru: Предыдущий пост

# postDetail.rating
source: Rating
ja: レーティング
ru: Рейтинг

# postDetail.removeFavorite
source: Remove from favorites
ja: お気に入りから削除
ru: Убрать из избранного

# postDetail.resetZoom
source: Reset zoom and position
ja: ズームと位置をリセット
ru: Сбросить зум и позицию

# postDetail.saving
source: Saving…
ja: 保存中…
ru: Сохранение…

# postDetail.send
source: Send
ja: 送信
ru: Отправить

# postDetail.showDownloads
source: Show downloads folder
ja: ダウンロードフォルダを表示
ru: Показать папку загрузок

# postDetail.tagAccessibility
source: Tag %@
ja: タグ %@
ru: Тег %@

# postDetail.tagAccessibilityHint
source: Double-tap to search.
ja: ダブルタップで検索。
ru: Двойной тап для поиска.

# postDetail.tagArtist
source: Artist
ja: 作者
ru: Художник

# postDetail.tagCharacter
source: Characters
ja: キャラクター
ru: Персонажи

# postDetail.tagCopyright
source: Copyright
ja: 版権
ru: Правообладатель

# postDetail.tagGeneral
source: General
ja: 一般
ru: Общие

# postDetail.tagHelp
source: Left click — search, right click — copy
ja: 左クリック — 検索、右クリック — コピー
ru: ЛКМ — поиск, ПКМ — копировать

# postDetail.tagMeta
source: Meta
ja: メタ
ru: Мета

# postDetail.tags
source: Tags
ja: タグ
ru: Теги

# postDetail.title
source: Post #%lld
ja: 投稿 #%lld
ru: Пост #%lld

# postDetail.ugoira
source: Ugoira
ja: うごイラ

# postDetail.ugoiraHint
source: Animated WebP — open in browser
ja: アニメーションWebP — ブラウザで開く
ru: Анимированный WebP — откройте в браузере

# postDetail.unavailable
source: Currently unavailable
ja: 現在利用できません
ru: Сейчас недоступно

# postDetail.upvotes
source: Upvotes
ja: 高評価
ru: Плюсы

# postDetail.voteDown
source: Vote -1
ja: 評価 -1
ru: Оценка -1

# postDetail.voteUp
source: Vote +1
ja: 評価 +1
ru: Оценка +1

# postDetail.yes
source: Yes
ja: はい
ru: Да

# postDetail.zoomIn
source: Zoom in
ja: 拡大
ru: Увеличить

# postDetail.zoomOut
source: Zoom out
ja: 縮小
ru: Уменьшить

# postTile.copyLargeURL
source: Copy large URL
ja: large URLをコピー
ru: Скопировать URL large

# postTile.copyPreviewURL
source: Copy preview URL
ja: プレビューURLをコピー
ru: Скопировать URL превью

# postTile.openLargeBrowser
source: Open large in browser
ja: ブラウザでlargeを開く
ru: Открыть large в браузере

# postTile.openOriginalBrowser
source: Open original in browser
ja: ブラウザでオリジナルを開く
ru: Открыть оригинал в браузере

# postTile.openPreviewBrowser
source: Open preview in browser
ja: ブラウザでプレビューを開く
ru: Открыть превью в браузере

# postTile.sensitiveContent
source: Sensitive content
ja: センシティブなコンテンツ
ru: Чувствительный контент

# rating.any
source: Any
ja: すべて
ru: Любой

# settings.allGood
source: All systems operational
ja: すべて正常に動作しています
ru: Все системы в норме

# settings.apiDocs
source: API documentation
ja: APIドキュメント
ru: Документация API

# settings.apiKey
source: API Key
ja: APIキー

# settings.apply
source: Apply
ja: 適用
ru: Применить

# settings.autoRefresh
source: Refresh posts on launch
ja: 起動時に投稿を更新
ru: Обновлять список постов при запуске

# settings.autoRefreshSubtitle
source: Automatically loads fresh posts when the app starts.
ja: アプリ起動時に最新の投稿を自動読み込みします。
ru: Автоматически загружает свежие посты при старте приложения.

# settings.baseURL
source: Base URL
ja: ベースURL

# settings.blurNSFW
source: Blur NSFW content by default
ja: デフォルトでNSFWコンテンツをぼかす
ru: Размывать контент NSFW по умолчанию

# settings.blurNSFWSubtitle
source: Applies blur to sensitive posts and details.
ja: センシティブな投稿と詳細にぼかしを適用します。
ru: Применяет блюр к чувствительным постам и деталям.

# settings.cacheCleared
source: Image cache cleared
ja: 画像キャッシュをクリアしました
ru: Кеш изображений очищен

# settings.cacheLimitUpdated
source: Cache limit updated
ja: キャッシュ上限を更新しました
ru: Лимит кеша обновлён

# settings.cacheUsage
source: Used: %@ MB
ja: 使用中: %@ MB
ru: Используется: %@ МБ

# settings.clear
source: Clear
ja: クリア
ru: Очистить

# settings.credentials
source: Danbooru Credentials
ja: Danbooru認証情報
ru: Учётные данные Danbooru

# settings.credentialsCleared
source: Credentials cleared
ja: データをクリアしました
ru: Данные очищены

# settings.credentialsDeleted
source: Credentials deleted
ja: データを削除しました
ru: Данные удалены

# settings.credentialsFootnote
source: Credentials are stored in the system Keychain and used for favorites, votes, and comments.
ja: 認証情報はシステムのキーチェーンに保存され、お気に入り、投票、コメントに使用されます。
ru: Данные хранятся в системном Keychain и используются для избранного, голосований и комментариев.

# settings.credentialsSaved
source: Credentials saved
ja: データを保存しました
ru: Данные сохранены

# settings.currentLimit
source: Current limit: %lld MB
ja: 現在の上限: %lld MB
ru: Текущий лимит: %lld МБ

# settings.deleteFailed
source: Failed to delete: %@
ja: 削除に失敗しました: %@
ru: Не удалось удалить: %@

# settings.general
source: General settings
ja: 一般設定
ru: Общие настройки

# settings.github
source: GitHub project
ja: GitHubプロジェクト
ru: Проект на GitHub

# settings.imageCache
source: Image cache
ja: 画像キャッシュ
ru: Кеш изображений

# settings.infiniteScroll
source: Infinite scroll
ja: 無限スクロール
ru: Бесконечная прокрутка

# settings.infiniteScrollSubtitle
source: Automatically load the next page when scrolling.
ja: スクロール時に次のページを自動読み込みします。
ru: Автоматически подгружать следующую страницу при прокрутке.

# settings.keyboardHints
source: Show keyboard shortcut hints
ja: キーボードショートカットのヒントを表示
ru: Показывать подсказки горячих клавиш

# settings.keyboardHintsSubtitle
source: Displays commands in the interface and tooltips.
ja: インターフェースとツールチップにコマンドを表示します。
ru: Отображает команды в интерфейсе и тултипах.

# settings.keychainSubtitle
source: Manage saved access keys
ja: 保存されたアクセスキーを管理
ru: Управление сохранёнными ключами доступа

# settings.linksAndTools
source: Links and tools
ja: リンクとツール
ru: Ссылки и инструменты

# settings.lowPerformance
source: Low performance mode
ja: 低パフォーマンスモード
ru: Щадящий режим (Low performance)

# settings.lowPerformanceSubtitle
source: Disables animations and reduces interpolation quality for weaker devices.
ja: アニメーションを無効にし、補間品質を下げて低スペック端末向けにします。
ru: Отключает анимации и снижает качество интерполяции для слабых устройств.

# settings.maxCacheSize
source: Maximum cache size
ja: 最大キャッシュサイズ
ru: Максимальный размер кеша

# settings.more
source: More
ja: その他
ru: Дополнительно

# settings.openKeychain
source: Open Keychain
ja: キーチェーンを開く
ru: Открыть Keychain

# settings.registered
source: Registered: %@
ja: 登録日: %@
ru: Зарегистрирован: %@

# settings.save
source: Save
ja: 保存
ru: Сохранить

# settings.saveFailed
source: Failed to save: %@
ja: 保存に失敗しました: %@
ru: Не удалось сохранить: %@

# settings.status
source: Status
ja: ステータス
ru: Состояние

# settings.username
source: Username
ja: ユーザー名
ru: Имя пользователя

# settings.verificationFailed
source: Verification failed: %@
ja: 検証に失敗しました: %@
ru: Ошибка проверки: %@

# sidebar.blurNSFW
source: Blur NSFW (Q/E)
ja: NSFWをぼかす (Q/E)
ru: Размывать NSFW (Q/E)

# sidebar.clear
source: Clear
ja: クリア
ru: Очистить

# sidebar.delete
source: Delete
ja: 削除
ru: Удалить

# sidebar.favorites.help
source: Search posts you've favorited
ja: お気に入りの投稿を検索
ru: Поиск избранных постов

# sidebar.favorites.subtitleOwn
source: Your favorited posts
ja: お気に入りの投稿
ru: Ваши избранные посты

# sidebar.favorites.title
source: My Favorites
ja: お気に入り
ru: Моё избранное

# sidebar.keyboardHintFull
source: Enter: search • ↑/↓: navigate • Tab/Enter: apply suggestion
ja: Enter: 検索 • ↑/↓: 移動 • Tab/Enter: 候補を適用
ru: Enter: поиск • ↑/↓: навигация • Tab/Enter: применить подсказку

# sidebar.keyboardHintShort
source: Enter: search
ja: Enter: 検索
ru: Enter: поиск

# sidebar.pageSize
source: Page size
ja: ページサイズ
ru: Размер страницы

# sidebar.pin
source: Pin
ja: ピン留め
ru: Закрепить

# sidebar.poolID
source: Pool ID
ja: プール ID
ru: ID пула

# sidebar.rating
source: Rating
ja: レーティング
ru: Рейтинг

# sidebar.recentSearches
source: Recent Searches
ja: 最近の検索
ru: Недавние поиски

# sidebar.save
source: Save
ja: 保存
ru: Сохранить

# sidebar.savedSearches
source: Saved Searches
ja: 保存した検索
ru: Сохранённые поиски

# sidebar.search.button
source: Search
ja: 検索
ru: Поиск

# sidebar.search.placeholder
source: Enter tags…
ja: タグを入力…
ru: Введите теги…

# sidebar.search.subtitle
source: Find posts with tags
ja: タグで投稿を検索
ru: Найти посты по тегам

# sidebar.search.title
source: Search
ja: 検索
ru: Поиск

# sidebar.sort
source: Sort
ja: 並べ替え
ru: Сортировка

# sidebar.tileSize
source: Tile size
ja: タイルサイズ
ru: Размер плиток

# sidebar.unpin
source: Unpin
ja: ピン留め解除
ru: Открепить

# sort.favs
source: Favs
ja: お気に入り数
ru: Избранное

# sort.newest
source: Newest
ja: 新しい順
ru: Новейшие

# sort.oldest
source: Oldest
ja: 古い順
ru: Старейшие

# sort.random
source: Random
ja: ランダム
ru: Случайные

# sort.rank
source: Rank
ja: ランク
ru: Ранг

# sort.recent
source: Recent
ja: 最近
ru: Недавние

# sort.score
source: Score
ja: スコア
ru: Оценка

# tileSize.large
source: Large
ja: 大
ru: Большой

# tileSize.medium
source: Medium
ja: 中
ru: Средний

# tileSize.small
source: Small
ja: 小
ru: Маленький

# toast.addCredentials
source: Add Danbooru credentials in Settings
ja: 設定でDanbooruの認証情報を追加してください
ru: Добавьте учетные данные Danbooru в Настройках

# toast.addedFavorite
source: Added to favorites
ja: お気に入りに追加しました
ru: Добавлено в избранное

# toast.commentSent
source: Comment sent
ja: コメントを送信しました
ru: Комментарий отправлен

# toast.copyFailed
source: Copy failed: %@
ja: コピーに失敗しました: %@
ru: Ошибка копирования: %@

# toast.decodeImageFailed
source: Failed to decode image
ja: 画像のデコードに失敗しました
ru: Не удалось декодировать изображение

# toast.downloadsFolderFailed
source: Failed to open downloads folder: %@
ja: ダウンロードフォルダを開けませんでした: %@
ru: Не удалось открыть папку загрузок: %@

# toast.imageCopied
source: Image copied
ja: 画像をコピーしました
ru: Изображение скопировано

# toast.originalURLCopied
source: Original URL copied
ja: オリジナルURLをコピーしました
ru: URL оригинала скопирован

# toast.postURLCopied
source: Post URL copied
ja: 投稿URLをコピーしました
ru: URL поста скопирован

# toast.removedFavorite
source: Removed from favorites
ja: お気に入りから削除しました
ru: Удалено из избранного

# toast.savedToDownloads
source: Saved to Downloads/Macbooru
ja: ダウンロード/Macbooruに保存しました
ru: Сохранено в Загрузки/Macbooru

# toast.saveFailed
source: Save failed: %@
ja: 保存に失敗しました: %@
ru: Ошибка сохранения: %@

# toast.sourceURLCopied
source: Source URL copied
ja: ソースURLをコピーしました
ru: URL источника скопирован

# toast.tagCopied
source: Tag copied: %@
ja: タグをコピーしました: %@
ru: Тег скопирован: %@

# toast.tagsCopied
source: Tags copied
ja: タグをコピーしました
ru: Теги скопированы

# toast.voteDownSent
source: Vote -1 sent
ja: 評価 -1 を送信しました
ru: Оценка -1 отправлена

# toast.voteUpSent
source: Vote +1 sent
ja: 評価 +1 を送信しました
ru: Оценка +1 отправлена
